<template>
  <div>
    <vxe-notice-bar content="默认尺寸，vxe-table 是一个基于 vue 的 PC 端表单/表格组件，支持增删改查、虚拟树、列拖拽、懒加载、快捷菜单、数据校验、导入/导出/打印、表单渲染、自定义模板、渲染器、JSON 配置式的全功能表格，适用于低代码平台。vxe-table 是一个基于 vue 的 PC 端表单/表格组件，支持增删改查、虚拟树、列拖拽、懒加载、快捷菜单、数据校验、导入/导出/打印、表单渲染、自定义模板、渲染器、JSON 配置式的全功能表格，适用于低代码平台。"></vxe-notice-bar>
    <vxe-notice-bar size="medium" content="中等尺寸，vxe-table 是一个基于 vue 的 PC 端表单/表格组件，支持增删改查、虚拟树、列拖拽、懒加载、快捷菜单、数据校验、导入/导出/打印、表单渲染、自定义模板、渲染器、JSON 配置式的全功能表格，适用于低代码平台。vxe-table 是一个基于 vue 的 PC 端表单/表格组件，支持增删改查、虚拟树、列拖拽、懒加载、快捷菜单、数据校验、导入/导出/打印、表单渲染、自定义模板、渲染器、JSON 配置式的全功能表格，适用于低代码平台。"></vxe-notice-bar>
    <vxe-notice-bar size="small" content="小型尺寸，vxe-table 是一个基于 vue 的 PC 端表单/表格组件，支持增删改查、虚拟树、列拖拽、懒加载、快捷菜单、数据校验、导入/导出/打印、表单渲染、自定义模板、渲染器、JSON 配置式的全功能表格，适用于低代码平台。vxe-table 是一个基于 vue 的 PC 端表单/表格组件，支持增删改查、虚拟树、列拖拽、懒加载、快捷菜单、数据校验、导入/导出/打印、表单渲染、自定义模板、渲染器、JSON 配置式的全功能表格，适用于低代码平台。"></vxe-notice-bar>
    <vxe-notice-bar size="mini" content="超小尺寸，vxe-table 是一个基于 vue 的 PC 端表单/表格组件，支持增删改查、虚拟树、列拖拽、懒加载、快捷菜单、数据校验、导入/导出/打印、表单渲染、自定义模板、渲染器、JSON 配置式的全功能表格，适用于低代码平台。vxe-table 是一个基于 vue 的 PC 端表单/表格组件，支持增删改查、虚拟树、列拖拽、懒加载、快捷菜单、数据校验、导入/导出/打印、表单渲染、自定义模板、渲染器、JSON 配置式的全功能表格，适用于低代码平台。"></vxe-notice-bar>
  </div>
</template>
